// 자바스크립트는 웹 서버를 동작하기 위한 도구로, 서버 사이드 스크립트라고도한다. 
//               웹 브라우저를 제어하기 위한 도구
//             (사용자가 어떤 행동을 했을 때 작동)

// 웹서버에서 사용되는 언어가 대표적으로 PHP, JAVA, PYTHON 등이 있는데
// 웹 브라우저가 주소에 해당하는 웹 서버에 어떠한 정보가 필요하다고 요청을 하면
// 웹 서버가 사용자가 요청한 정보를 웹 브라우저에 응답하게 됨. 

// Node.js를 배우게 되면 
// 웹 브라우저를 제어하기 위해 javascript로 배우게되고 
// 웹 서버 동작을 Node.js로 하기 때문에 웹 브라우저와 웹 서버 모두 javascript로 하게 된다는 장점이 있음. 



//! 자바스크립트의 중요 기능 
// => 탈웹
// ex) Google Apps Script -> 자바스크립트 문법에 따라 작성해야함.

// 언어란?
// 의사소통을 위한 약속

// 환경
// 언어를 사용하는 대상 
// ~해주세요 (언어)

// 의사에게 개발 해주세요, 변호사에게 치료 해주세요 라고하면 못함
// 그 사람이 무슨 일을 하는지 숙지하고 있어야 목적을 달성할 수 있음

// 이처럼
// js에서 'Hello World'라고 했을 때

// alert('Hello World') -> 웹 브라우저 경고창으로 출력
// write('Hello World') -> Node.js 웹페이지에 출력
// msgBox('Hello World') -> google spreadSheet 다이얼로그에 출력

// js는 언어,
// 웹 브라우저, node.js, SpreadSheet는 환경이 됨.




// Sublime Text (개발 도구) - 단점 : 유료 장점: 가볍고, 여러 확장프로그램이 있어서 편함
// IDE (통합 개발 도구)
